[Killed] BlockStatement
lib/rate-limiting/cleanup.ts:8:38
 
 let cleanupTimer: ReturnType<typeof setInterval> | null = null;
 
-export function startCleanup(): void {
-  if (!rateLimitConfig.cleanup.enabled) return;
-  if (cleanupTimer) return;
-
-  cleanupTimer = setInterval(async () => {
-    try {
-      await rateLimiter.prune();
-
-      const count = await prisma.rateLimit.count({
-        where: { OR: [{ id: { startsWith: "app:" } }, { id: { startsWith: "anon:" } }] },
-      });
-      setActiveKeyCount(count);
-    } catch (err) {
-      console.error("[rate-limit] cleanup failed:", err);
-    }
-  }, rateLimitConfig.cleanup.intervalMs);
-
-  cleanupTimer.unref();
-}
+export function startCleanup(): void {}
 
 export function stopCleanup(): void {
killedBy: IDOR — User Resource Isolation user A cannot see user B's bookmark
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[Killed] BooleanLiteral
lib/rate-limiting/cleanup.ts:9:7
 let cleanupTimer: ReturnType<typeof setInterval> | null = null;
 
 export function startCleanup(): void {
-  if (!rateLimitConfig.cleanup.enabled) return;
+  if (rateLimitConfig.cleanup.enabled) return;
   if (cleanupTimer) return;
 
killedBy: IDOR — User Resource Isolation user A cannot see user B's bookmark
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[Killed] ConditionalExpression
lib/rate-limiting/cleanup.ts:9:7
 let cleanupTimer: ReturnType<typeof setInterval> | null = null;
 
 export function startCleanup(): void {
-  if (!rateLimitConfig.cleanup.enabled) return;
+  if (true) return;
   if (cleanupTimer) return;
 
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: expected 404 to be 201 // Object.is equality

[Killed] ConditionalExpression
lib/rate-limiting/cleanup.ts:10:7
 
 export function startCleanup(): void {
   if (!rateLimitConfig.cleanup.enabled) return;
-  if (cleanupTimer) return;
+  if (true) return;
 
   cleanupTimer = setInterval(async () => {
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[Killed] ConditionalExpression
lib/rate-limiting/cleanup.ts:10:7
 
 export function startCleanup(): void {
   if (!rateLimitConfig.cleanup.enabled) return;
-  if (cleanupTimer) return;
+  if (false) return;
 
   cleanupTimer = setInterval(async () => {
killedBy: IDOR — User Resource Isolation user A cannot see user B's bookmark
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[NoCoverage] BlockStatement
lib/rate-limiting/cleanup.ts:12:42
   if (!rateLimitConfig.cleanup.enabled) return;
   if (cleanupTimer) return;
 
-  cleanupTimer = setInterval(async () => {
-    try {
-      await rateLimiter.prune();
-
-      const count = await prisma.rateLimit.count({
-        where: { OR: [{ id: { startsWith: "app:" } }, { id: { startsWith: "anon:" } }] },
-      });
-      setActiveKeyCount(count);
-    } catch (err) {
-      console.error("[rate-limit] cleanup failed:", err);
-    }
-  }, rateLimitConfig.cleanup.intervalMs);
+  cleanupTimer = setInterval(async () => {}, rateLimitConfig.cleanup.intervalMs);
 
   cleanupTimer.unref();

[NoCoverage] BlockStatement
lib/rate-limiting/cleanup.ts:13:9
   if (cleanupTimer) return;
 
   cleanupTimer = setInterval(async () => {
-    try {
-      await rateLimiter.prune();
-
-      const count = await prisma.rateLimit.count({
-        where: { OR: [{ id: { startsWith: "app:" } }, { id: { startsWith: "anon:" } }] },
-      });
-      setActiveKeyCount(count);
-    } catch (err) {
+    try {} catch (err) {
       console.error("[rate-limit] cleanup failed:", err);
     }

[NoCoverage] ObjectLiteral
lib/rate-limiting/cleanup.ts:17:29
       await rateLimiter.prune();
 
       const count = await prisma.rateLimit.count({
-        where: { OR: [{ id: { startsWith: "app:" } }, { id: { startsWith: "anon:" } }] },
+        where: { OR: [{ id: {} }, { id: { startsWith: "anon:" } }] },
       });
       setActiveKeyCount(count);

[NoCoverage] ObjectLiteral
lib/rate-limiting/cleanup.ts:17:16
       await rateLimiter.prune();
 
       const count = await prisma.rateLimit.count({
-        where: { OR: [{ id: { startsWith: "app:" } }, { id: { startsWith: "anon:" } }] },
+        where: {},
       });
       setActiveKeyCount(count);

[NoCoverage] BlockStatement
lib/rate-limiting/cleanup.ts:20:19
         where: { OR: [{ id: { startsWith: "app:" } }, { id: { startsWith: "anon:" } }] },
       });
       setActiveKeyCount(count);
-    } catch (err) {
-      console.error("[rate-limit] cleanup failed:", err);
-    }
+    } catch (err) {}
   }, rateLimitConfig.cleanup.intervalMs);
 

[NoCoverage] StringLiteral
lib/rate-limiting/cleanup.ts:21:21
       });
       setActiveKeyCount(count);
     } catch (err) {
-      console.error("[rate-limit] cleanup failed:", err);
+      console.error("", err);
     }
   }, rateLimitConfig.cleanup.intervalMs);

[NoCoverage] BlockStatement
lib/rate-limiting/cleanup.ts:28:37
   cleanupTimer.unref();
 }
 
-export function stopCleanup(): void {
-  if (cleanupTimer) {
-    clearInterval(cleanupTimer);
-    cleanupTimer = null;
-  }
-}
+export function stopCleanup(): void {}
 

[NoCoverage] ConditionalExpression
lib/rate-limiting/cleanup.ts:29:7
 }
 
 export function stopCleanup(): void {
-  if (cleanupTimer) {
+  if (false) {
     clearInterval(cleanupTimer);
     cleanupTimer = null;

[NoCoverage] BlockStatement
lib/rate-limiting/cleanup.ts:29:21
 }
 
 export function stopCleanup(): void {
-  if (cleanupTimer) {
-    clearInterval(cleanupTimer);
-    cleanupTimer = null;
-  }
+  if (cleanupTimer) {}
 }
 
