[Killed] BlockStatement
lib/rate-limiting/middleware.ts:27:65
   context: RouteContext<TParams>,
 ) => Promise<NextResponse>;
 
-function getEffectiveMax(role: string, baseMax: number): number {
-  const roleCfg =
-    rateLimitConfig.roles[role as keyof typeof rateLimitConfig.roles] ??
-    rateLimitConfig.roles.anonymous;
-  return Math.round(baseMax * roleCfg.multiplier);
-}
+function getEffectiveMax(role: string, baseMax: number): number {}
 
 function getActorKey(session: { id: string } | null, ip: string, role: string): string {
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[Killed] LogicalOperator
lib/rate-limiting/middleware.ts:29:5
 
 function getEffectiveMax(role: string, baseMax: number): number {
   const roleCfg =
-    rateLimitConfig.roles[role as keyof typeof rateLimitConfig.roles] ??
-    rateLimitConfig.roles.anonymous;
+    rateLimitConfig.roles[role as keyof typeof rateLimitConfig.roles] && rateLimitConfig.roles.anonymous;
   return Math.round(baseMax * roleCfg.multiplier);
 }
killedBy: IDOR — User Resource Isolation user A cannot see user B's bookmark
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[Killed] ArithmeticOperator
lib/rate-limiting/middleware.ts:31:21
   const roleCfg =
     rateLimitConfig.roles[role as keyof typeof rateLimitConfig.roles] ??
     rateLimitConfig.roles.anonymous;
-  return Math.round(baseMax * roleCfg.multiplier);
+  return Math.round(baseMax / roleCfg.multiplier);
 }
 
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[Killed] BlockStatement
lib/rate-limiting/middleware.ts:34:88
   return Math.round(baseMax * roleCfg.multiplier);
 }
 
-function getActorKey(session: { id: string } | null, ip: string, role: string): string {
-  if (session) {
-    if (role === "anonymous") {
-      return `anon:${ipHash(ip, process.env[rateLimitConfig.ipHashing.saltEnvVar] ?? "", rateLimitConfig.ipHashing.digestLength)}`;
-    }
-    return session.id;
-  }
-  return `anon:${ipHash(ip, process.env[rateLimitConfig.ipHashing.saltEnvVar] ?? "", rateLimitConfig.ipHashing.digestLength)}`;
-}
+function getActorKey(session: { id: string } | null, ip: string, role: string): string {}
 
 function extractIP(request: NextRequest): string {
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: expected 404 to be 201 // Object.is equality

[Killed] ConditionalExpression
lib/rate-limiting/middleware.ts:35:7
 }
 
 function getActorKey(session: { id: string } | null, ip: string, role: string): string {
-  if (session) {
+  if (true) {
     if (role === "anonymous") {
       return `anon:${ipHash(ip, process.env[rateLimitConfig.ipHashing.saltEnvVar] ?? "", rateLimitConfig.ipHashing.digestLength)}`;
killedBy: User Resumes CRUD (Phase 4.7) soft-deleted resume excluded from list
statusReason: Invalid `prisma.resume.update()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\integration\user\resumes.test.ts:83:25

  80 const user = await createTestUser({ role: Role.user });
  81 await createTestResume(user.id, { label: "Active" });
  82 const r2 = await createTestResume(user.id, { label: "Deleted" });
→ 83 await prisma.resume.update(
An operation failed because it dep

[Killed] ConditionalExpression
lib/rate-limiting/middleware.ts:35:7
 }
 
 function getActorKey(session: { id: string } | null, ip: string, role: string): string {
-  if (session) {
+  if (false) {
     if (role === "anonymous") {
       return `anon:${ipHash(ip, process.env[rateLimitConfig.ipHashing.saltEnvVar] ?? "", rateLimitConfig.ipHashing.digestLength)}`;
killedBy: IDOR — Message Thread Isolation user A cannot access thread between user B and recruiter
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[Killed] ConditionalExpression
lib/rate-limiting/middleware.ts:36:9
 
 function getActorKey(session: { id: string } | null, ip: string, role: string): string {
   if (session) {
-    if (role === "anonymous") {
+    if (true) {
       return `anon:${ipHash(ip, process.env[rateLimitConfig.ipHashing.saltEnvVar] ?? "", rateLimitConfig.ipHashing.digestLength)}`;
     }
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[Killed] ConditionalExpression
lib/rate-limiting/middleware.ts:36:9
 
 function getActorKey(session: { id: string } | null, ip: string, role: string): string {
   if (session) {
-    if (role === "anonymous") {
+    if (false) {
       return `anon:${ipHash(ip, process.env[rateLimitConfig.ipHashing.saltEnvVar] ?? "", rateLimitConfig.ipHashing.digestLength)}`;
     }
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[NoCoverage] LogicalOperator
lib/rate-limiting/middleware.ts:37:33
 function getActorKey(session: { id: string } | null, ip: string, role: string): string {
   if (session) {
     if (role === "anonymous") {
-      return `anon:${ipHash(ip, process.env[rateLimitConfig.ipHashing.saltEnvVar] ?? "", rateLimitConfig.ipHashing.digestLength)}`;
+      return `anon:${ipHash(ip, process.env[rateLimitConfig.ipHashing.saltEnvVar] && "", rateLimitConfig.ipHashing.digestLength)}`;
     }
     return session.id;

[Killed] LogicalOperator
lib/rate-limiting/middleware.ts:41:29
     }
     return session.id;
   }
-  return `anon:${ipHash(ip, process.env[rateLimitConfig.ipHashing.saltEnvVar] ?? "", rateLimitConfig.ipHashing.digestLength)}`;
+  return `anon:${ipHash(ip, process.env[rateLimitConfig.ipHashing.saltEnvVar] && "", rateLimitConfig.ipHashing.digestLength)}`;
 }
 
killedBy: createWithRateLimit applies anonymous multiplier for unauthenticated requests
statusReason: The "key" argument must be of type string or an instance of ArrayBuffer, Buffer, TypedArray, DataView, KeyObject, or CryptoKey. Received undefined

[Survived] StringLiteral
lib/rate-limiting/middleware.ts:41:10
     }
     return session.id;
   }
-  return `anon:${ipHash(ip, process.env[rateLimitConfig.ipHashing.saltEnvVar] ?? "", rateLimitConfig.ipHashing.digestLength)}`;
+  return ``;
 }
 

[Killed] BlockStatement
lib/rate-limiting/middleware.ts:44:50
   return `anon:${ipHash(ip, process.env[rateLimitConfig.ipHashing.saltEnvVar] ?? "", rateLimitConfig.ipHashing.digestLength)}`;
 }
 
-function extractIP(request: NextRequest): string {
-  if (rateLimitConfig.proxy.trusted) {
-    const forwarded = request.headers.get(rateLimitConfig.proxy.trustedHeader);
-    if (forwarded) {
-      if (rateLimitConfig.proxy.trustedHeader === "x-forwarded-for") {
-        return forwarded.split(",")[0].trim();
-      }
-      return forwarded;
-    }
-  }
-  return request.headers.get("x-real-ip") ?? "127.0.0.1";
-}
+function extractIP(request: NextRequest): string {}
 
 function buildServiceUnavailableResponse(statusCode: number): NextResponse {
killedBy: IDOR — User Resource Isolation user A cannot see user B's bookmark
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[Killed] ConditionalExpression
lib/rate-limiting/middleware.ts:45:7
 }
 
 function extractIP(request: NextRequest): string {
-  if (rateLimitConfig.proxy.trusted) {
+  if (true) {
     const forwarded = request.headers.get(rateLimitConfig.proxy.trustedHeader);
     if (forwarded) {
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[Killed] ConditionalExpression
lib/rate-limiting/middleware.ts:45:7
 }
 
 function extractIP(request: NextRequest): string {
-  if (rateLimitConfig.proxy.trusted) {
+  if (false) {
     const forwarded = request.headers.get(rateLimitConfig.proxy.trustedHeader);
     if (forwarded) {
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[NoCoverage] ConditionalExpression
lib/rate-limiting/middleware.ts:47:9
 function extractIP(request: NextRequest): string {
   if (rateLimitConfig.proxy.trusted) {
     const forwarded = request.headers.get(rateLimitConfig.proxy.trustedHeader);
-    if (forwarded) {
+    if (false) {
       if (rateLimitConfig.proxy.trustedHeader === "x-forwarded-for") {
         return forwarded.split(",")[0].trim();

[NoCoverage] ConditionalExpression
lib/rate-limiting/middleware.ts:47:9
 function extractIP(request: NextRequest): string {
   if (rateLimitConfig.proxy.trusted) {
     const forwarded = request.headers.get(rateLimitConfig.proxy.trustedHeader);
-    if (forwarded) {
+    if (true) {
       if (rateLimitConfig.proxy.trustedHeader === "x-forwarded-for") {
         return forwarded.split(",")[0].trim();

[NoCoverage] ConditionalExpression
lib/rate-limiting/middleware.ts:48:11
   if (rateLimitConfig.proxy.trusted) {
     const forwarded = request.headers.get(rateLimitConfig.proxy.trustedHeader);
     if (forwarded) {
-      if (rateLimitConfig.proxy.trustedHeader === "x-forwarded-for") {
+      if (false) {
         return forwarded.split(",")[0].trim();
       }

[NoCoverage] EqualityOperator
lib/rate-limiting/middleware.ts:48:11
   if (rateLimitConfig.proxy.trusted) {
     const forwarded = request.headers.get(rateLimitConfig.proxy.trustedHeader);
     if (forwarded) {
-      if (rateLimitConfig.proxy.trustedHeader === "x-forwarded-for") {
+      if (rateLimitConfig.proxy.trustedHeader !== "x-forwarded-for") {
         return forwarded.split(",")[0].trim();
       }

[NoCoverage] MethodExpression
lib/rate-limiting/middleware.ts:49:16
     const forwarded = request.headers.get(rateLimitConfig.proxy.trustedHeader);
     if (forwarded) {
       if (rateLimitConfig.proxy.trustedHeader === "x-forwarded-for") {
-        return forwarded.split(",")[0].trim();
+        return forwarded.split(",")[0];
       }
       return forwarded;

[Killed] LogicalOperator
lib/rate-limiting/middleware.ts:54:10
       return forwarded;
     }
   }
-  return request.headers.get("x-real-ip") ?? "127.0.0.1";
+  return request.headers.get("x-real-ip") && "127.0.0.1";
 }
 
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: Invalid `prisma.job.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\job.factory.ts:25:21

  22 ) {
  23   const title = overrides?.title ?? faker.person.jobTitle();
  24   const slug = overrides?.slug ?? slugify(title);
→ 25   return prisma.job.create(
Foreign key constraint violated on the constraint: `job_recruiterId_fkey`

[NoCoverage] BlockStatement
lib/rate-limiting/middleware.ts:57:76
   return request.headers.get("x-real-ip") ?? "127.0.0.1";
 }
 
-function buildServiceUnavailableResponse(statusCode: number): NextResponse {
-  return NextResponse.json(
-    { success: false, error: "Service temporarily unavailable. Please try again." },
-    { status: statusCode },
-  );
-}
+function buildServiceUnavailableResponse(statusCode: number): NextResponse {}
 
 export function createWithRateLimit(rateLimiter: RateLimiter) {

[NoCoverage] BooleanLiteral
lib/rate-limiting/middleware.ts:59:16
 
 function buildServiceUnavailableResponse(statusCode: number): NextResponse {
   return NextResponse.json(
-    { success: false, error: "Service temporarily unavailable. Please try again." },
+    { success: true, error: "Service temporarily unavailable. Please try again." },
     { status: statusCode },
   );

[NoCoverage] StringLiteral
lib/rate-limiting/middleware.ts:59:30
 
 function buildServiceUnavailableResponse(statusCode: number): NextResponse {
   return NextResponse.json(
-    { success: false, error: "Service temporarily unavailable. Please try again." },
+    { success: false, error: "" },
     { status: statusCode },
   );

[NoCoverage] ObjectLiteral
lib/rate-limiting/middleware.ts:60:5
 function buildServiceUnavailableResponse(statusCode: number): NextResponse {
   return NextResponse.json(
     { success: false, error: "Service temporarily unavailable. Please try again." },
-    { status: statusCode },
+    {},
   );
 }

[Killed] LogicalOperator
lib/rate-limiting/middleware.ts:84:20
       const user = session?.user as
         | { id: string; name: string; email: string; role?: string }
         | undefined;
-      const role = user?.role ?? "anonymous";
+      const role = user?.role && "anonymous";
 
       const baseSession = {
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[Killed] OptionalChaining
lib/rate-limiting/middleware.ts:84:20
       const user = session?.user as
         | { id: string; name: string; email: string; role?: string }
         | undefined;
-      const role = user?.role ?? "anonymous";
+      const role = user.role ?? "anonymous";
 
       const baseSession = {
killedBy: IDOR — User Resource Isolation user A cannot see user B's notifications
statusReason: Invalid `prisma.notification.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\integration\auth\auth.idor.test.ts:173:31

  170 const userA = await createTestUser({ role: Role.user });
  171 const userB = await createTestUser({ role: Role.user });
  172 
→ 173 await prisma.notification.create(
Foreign key constraint violated on the constraint: `notification_userId_fkey

[Killed] ObjectLiteral
lib/rate-limiting/middleware.ts:86:27
         | undefined;
       const role = user?.role ?? "anonymous";
 
-      const baseSession = {
-        id: user?.id ?? "",
-        name: user?.name ?? "",
-        email: user?.email ?? "",
-        role,
-      };
+      const baseSession = {};
 
       const runHandler = () =>
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[Killed] OptionalChaining
lib/rate-limiting/middleware.ts:87:13
       const role = user?.role ?? "anonymous";
 
       const baseSession = {
-        id: user?.id ?? "",
+        id: user.id ?? "",
         name: user?.name ?? "",
         email: user?.email ?? "",
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[Killed] LogicalOperator
lib/rate-limiting/middleware.ts:87:13
       const role = user?.role ?? "anonymous";
 
       const baseSession = {
-        id: user?.id ?? "",
+        id: user?.id && "",
         name: user?.name ?? "",
         email: user?.email ?? "",
killedBy: IDOR — Message Thread Isolation user A cannot access thread between user B and recruiter
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[Killed] LogicalOperator
lib/rate-limiting/middleware.ts:88:15
 
       const baseSession = {
         id: user?.id ?? "",
-        name: user?.name ?? "",
+        name: user?.name && "",
         email: user?.email ?? "",
         role,
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: Invalid `prisma.resume.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\resume.factory.ts:19:24

  16   userId: string,
  17   overrides?: Partial<Prisma.ResumeUncheckedCreateInput>,
  18 ) {
→ 19   return prisma.resume.create(
Foreign key constraint violated on the constraint: `resume_userId_fkey`

[Killed] OptionalChaining
lib/rate-limiting/middleware.ts:88:15
 
       const baseSession = {
         id: user?.id ?? "",
-        name: user?.name ?? "",
+        name: user.name ?? "",
         email: user?.email ?? "",
         role,
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: Invalid `prisma.resume.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\resume.factory.ts:19:24

  16   userId: string,
  17   overrides?: Partial<Prisma.ResumeUncheckedCreateInput>,
  18 ) {
→ 19   return prisma.resume.create(
Foreign key constraint violated on the constraint: `resume_userId_fkey`

[Killed] OptionalChaining
lib/rate-limiting/middleware.ts:89:16
       const baseSession = {
         id: user?.id ?? "",
         name: user?.name ?? "",
-        email: user?.email ?? "",
+        email: user.email ?? "",
         role,
       };
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[Killed] LogicalOperator
lib/rate-limiting/middleware.ts:89:16
       const baseSession = {
         id: user?.id ?? "",
         name: user?.name ?? "",
-        email: user?.email ?? "",
+        email: user?.email && "",
         role,
       };
killedBy: IDOR — User Resource Isolation user A cannot see user B's notifications
statusReason: Invalid `prisma.notification.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\integration\auth\auth.idor.test.ts:173:31

  170 const userA = await createTestUser({ role: Role.user });
  171 const userB = await createTestUser({ role: Role.user });
  172 
→ 173 await prisma.notification.create(
Foreign key constraint violated on the constraint: `notification_userId_fkey

[Killed] ArrowFunction
lib/rate-limiting/middleware.ts:93:26
         role,
       };
 
-      const runHandler = () =>
-        runWithTraceContext({ requestId }, () => {
-          if (context) {
-            return (handler as ParamHandler<Record<string, string>>)(request, context);
-          }
-          return (handler as SimpleHandler)(request);
-        });
+      const runHandler = () => undefined;
 
       const runRateLimit = async (): Promise<NextResponse> => {
killedBy: IDOR — User Resource Isolation user A cannot see user B's bookmark
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
lib/rate-limiting/middleware.ts:94:50
       };
 
       const runHandler = () =>
-        runWithTraceContext({ requestId }, () => {
-          if (context) {
-            return (handler as ParamHandler<Record<string, string>>)(request, context);
-          }
-          return (handler as SimpleHandler)(request);
-        });
+        runWithTraceContext({ requestId }, () => {});
 
       const runRateLimit = async (): Promise<NextResponse> => {
killedBy: IDOR — User Resource Isolation user A cannot see user B's bookmark
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[Killed] ConditionalExpression
lib/rate-limiting/middleware.ts:95:15
 
       const runHandler = () =>
         runWithTraceContext({ requestId }, () => {
-          if (context) {
+          if (true) {
             return (handler as ParamHandler<Record<string, string>>)(request, context);
           }
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[Killed] BlockStatement
lib/rate-limiting/middleware.ts:95:24
 
       const runHandler = () =>
         runWithTraceContext({ requestId }, () => {
-          if (context) {
-            return (handler as ParamHandler<Record<string, string>>)(request, context);
-          }
+          if (context) {}
           return (handler as SimpleHandler)(request);
         });
killedBy: IDOR — User Resource Isolation user A cannot see user B's bookmark
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BooleanLiteral
lib/rate-limiting/middleware.ts:102:13
         });
 
       const runRateLimit = async (): Promise<NextResponse> => {
-        if (!rateLimitConfig.enabled) {
+        if (rateLimitConfig.enabled) {
           return runHandler();
         }
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: expected 404 to be 201 // Object.is equality

[Killed] ConditionalExpression
lib/rate-limiting/middleware.ts:102:13
         });
 
       const runRateLimit = async (): Promise<NextResponse> => {
-        if (!rateLimitConfig.enabled) {
+        if (true) {
           return runHandler();
         }
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[Killed] ConditionalExpression
lib/rate-limiting/middleware.ts:107:38
         }
 
         const ip = extractIP(request);
-        const actorKey = getActorKey(session && user ? { id: user.id } : null, ip, role);
+        const actorKey = getActorKey(false ? { id: user.id } : null, ip, role);
         const endpointCfg = rateLimitConfig.endpoints[endpointKey] ?? rateLimitConfig.default;
         const effectiveMax = getEffectiveMax(role, endpointCfg.max);
killedBy: User Resumes CRUD (Phase 4.7) list own resumes
statusReason: Invalid `prisma.resume.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\resume.factory.ts:19:24

  16   userId: string,
  17   overrides?: Partial<Prisma.ResumeUncheckedCreateInput>,
  18 ) {
→ 19   return prisma.resume.create(
Foreign key constraint violated on the constraint: `resume_userId_fkey`

[Killed] ConditionalExpression
lib/rate-limiting/middleware.ts:107:38
         }
 
         const ip = extractIP(request);
-        const actorKey = getActorKey(session && user ? { id: user.id } : null, ip, role);
+        const actorKey = getActorKey(true ? { id: user.id } : null, ip, role);
         const endpointCfg = rateLimitConfig.endpoints[endpointKey] ?? rateLimitConfig.default;
         const effectiveMax = getEffectiveMax(role, endpointCfg.max);
killedBy: IDOR — User Resource Isolation user A cannot see user B's notifications
statusReason: Invalid `prisma.notification.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\integration\auth\auth.idor.test.ts:173:31

  170 const userA = await createTestUser({ role: Role.user });
  171 const userB = await createTestUser({ role: Role.user });
  172 
→ 173 await prisma.notification.create(
Foreign key constraint violated on the constraint: `notification_userId_fkey

[Killed] LogicalOperator
lib/rate-limiting/middleware.ts:108:29
 
         const ip = extractIP(request);
         const actorKey = getActorKey(session && user ? { id: user.id } : null, ip, role);
-        const endpointCfg = rateLimitConfig.endpoints[endpointKey] ?? rateLimitConfig.default;
+        const endpointCfg = rateLimitConfig.endpoints[endpointKey] && rateLimitConfig.default;
         const effectiveMax = getEffectiveMax(role, endpointCfg.max);
         const dbKey = `app:${endpointKey}:${actorKey}`;
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[Killed] StringLiteral
lib/rate-limiting/middleware.ts:110:23
         const actorKey = getActorKey(session && user ? { id: user.id } : null, ip, role);
         const endpointCfg = rateLimitConfig.endpoints[endpointKey] ?? rateLimitConfig.default;
         const effectiveMax = getEffectiveMax(role, endpointCfg.max);
-        const dbKey = `app:${endpointKey}:${actorKey}`;
+        const dbKey = ``;
 
         const failStrategy =
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`
