[Killed] LogicalOperator
lib/rate-limiting/middleware.ts:113:11
         const dbKey = `app:${endpointKey}:${actorKey}`;
 
         const failStrategy =
-          (endpointCfg as { failStrategy?: "open" | "closed" }).failStrategy ??
-          rateLimitConfig.failStrategy.default;
+          (endpointCfg as {
+  failStrategy?: "open" | "closed";
+}).failStrategy && rateLimitConfig.failStrategy.default;
 
         const start = performance.now();
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[Killed] BlockStatement
lib/rate-limiting/middleware.ts:118:13
 
         const start = performance.now();
         let result: RateLimitResult;
-        try {
-          const span = startCheckSpan(dbKey, effectiveMax);
-          result = await rateLimiter.check(dbKey, effectiveMax, endpointCfg.windowMs);
-          const durationMs = Math.round(performance.now() - start);
-          endCheckSpan(span, result.allowed, durationMs);
-          recordCheckDuration(durationMs, endpointKey);
-          recordDbLatency(durationMs);
-        } catch (err) {
+        try {} catch (err) {
           const durationMs = Math.round(performance.now() - start);
           recordCheckDuration(durationMs, endpointKey);
killedBy: User Resumes CRUD (Phase 4.7) list own resumes
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ArithmeticOperator
lib/rate-limiting/middleware.ts:121:41
         try {
           const span = startCheckSpan(dbKey, effectiveMax);
           result = await rateLimiter.check(dbKey, effectiveMax, endpointCfg.windowMs);
-          const durationMs = Math.round(performance.now() - start);
+          const durationMs = Math.round(performance.now() + start);
           endCheckSpan(span, result.allowed, durationMs);
           recordCheckDuration(durationMs, endpointKey);
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[Killed] BlockStatement
lib/rate-limiting/middleware.ts:125:23
           endCheckSpan(span, result.allowed, durationMs);
           recordCheckDuration(durationMs, endpointKey);
           recordDbLatency(durationMs);
-        } catch (err) {
-          const durationMs = Math.round(performance.now() - start);
-          recordCheckDuration(durationMs, endpointKey);
-          recordDbLatency(durationMs);
-          countRateLimitDecision({ endpoint: endpointKey, role, decision: "db_failure" });
-
-          if (err instanceof Error) {
-            const span = startCheckSpan(dbKey, effectiveMax);
-            recordSpanError(span, err);
-          }
-
-          if (failStrategy === "closed") {
-            return buildServiceUnavailableResponse(rateLimitConfig.failStrategy.statusCode);
-          }
-          return runHandler();
-        }
+        } catch (err) {}
 
         const decision = result.allowed ? "allowed" : "blocked";
killedBy: chaos - fail-closed during DB outage failStrategy default 'open' allows request through on DB error
statusReason: Cannot read properties of undefined (reading 'allowed')

[Survived] ArithmeticOperator
lib/rate-limiting/middleware.ts:126:41
           recordCheckDuration(durationMs, endpointKey);
           recordDbLatency(durationMs);
         } catch (err) {
-          const durationMs = Math.round(performance.now() - start);
+          const durationMs = Math.round(performance.now() + start);
           recordCheckDuration(durationMs, endpointKey);
           recordDbLatency(durationMs);

[Survived] ObjectLiteral
lib/rate-limiting/middleware.ts:129:34
           const durationMs = Math.round(performance.now() - start);
           recordCheckDuration(durationMs, endpointKey);
           recordDbLatency(durationMs);
-          countRateLimitDecision({ endpoint: endpointKey, role, decision: "db_failure" });
+          countRateLimitDecision({});
 
           if (err instanceof Error) {

[Survived] StringLiteral
lib/rate-limiting/middleware.ts:129:75
           const durationMs = Math.round(performance.now() - start);
           recordCheckDuration(durationMs, endpointKey);
           recordDbLatency(durationMs);
-          countRateLimitDecision({ endpoint: endpointKey, role, decision: "db_failure" });
+          countRateLimitDecision({ endpoint: endpointKey, role, decision: "" });
 
           if (err instanceof Error) {

[Survived] ConditionalExpression
lib/rate-limiting/middleware.ts:131:15
           recordDbLatency(durationMs);
           countRateLimitDecision({ endpoint: endpointKey, role, decision: "db_failure" });
 
-          if (err instanceof Error) {
+          if (false) {
             const span = startCheckSpan(dbKey, effectiveMax);
             recordSpanError(span, err);

[Survived] BlockStatement
lib/rate-limiting/middleware.ts:131:37
           recordDbLatency(durationMs);
           countRateLimitDecision({ endpoint: endpointKey, role, decision: "db_failure" });
 
-          if (err instanceof Error) {
-            const span = startCheckSpan(dbKey, effectiveMax);
-            recordSpanError(span, err);
-          }
+          if (err instanceof Error) {}
 
           if (failStrategy === "closed") {

[Killed] EqualityOperator
lib/rate-limiting/middleware.ts:136:15
             recordSpanError(span, err);
           }
 
-          if (failStrategy === "closed") {
+          if (failStrategy !== "closed") {
             return buildServiceUnavailableResponse(rateLimitConfig.failStrategy.statusCode);
           }
killedBy: chaos - fail-closed during DB outage failStrategy default 'open' allows request through on DB error
statusReason: expected 503 to be 200 // Object.is equality

[Killed] ConditionalExpression
lib/rate-limiting/middleware.ts:136:15
             recordSpanError(span, err);
           }
 
-          if (failStrategy === "closed") {
+          if (true) {
             return buildServiceUnavailableResponse(rateLimitConfig.failStrategy.statusCode);
           }
killedBy: chaos - fail-closed during DB outage failStrategy default 'open' allows request through on DB error
statusReason: expected 503 to be 200 // Object.is equality

[Killed] ObjectLiteral
lib/rate-limiting/middleware.ts:143:32
         }
 
         const decision = result.allowed ? "allowed" : "blocked";
-        countRateLimitDecision({ endpoint: endpointKey, role, decision });
+        countRateLimitDecision({});
 
         if (!result.allowed && !rateLimitConfig.shadowMode) {
killedBy: IDOR — User Resource Isolation user A cannot see user B's bookmark
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[Killed] BlockStatement
lib/rate-limiting/middleware.ts:145:61
         const decision = result.allowed ? "allowed" : "blocked";
         countRateLimitDecision({ endpoint: endpointKey, role, decision });
 
-        if (!result.allowed && !rateLimitConfig.shadowMode) {
-          const res = NextResponse.json(
-            { success: false, error: "Too many requests. Please try again later." },
-            {
-              status: 429,
-              headers: {
-                "Retry-After": String(result.retryAfter),
-                "X-RateLimit-Limit": String(result.limit),
-                "X-RateLimit-Remaining": "0",
-                "X-RateLimit-Reset": String(result.reset),
-              },
-            },
-          );
-          return res;
-        }
+        if (!result.allowed && !rateLimitConfig.shadowMode) {}
 
         const response = await runHandler();
killedBy: createWithRateLimit returns 429 when rate limit is exceeded
statusReason: expected 200 to be 429 // Object.is equality

[Killed] BooleanLiteral
lib/rate-limiting/middleware.ts:145:13
         const decision = result.allowed ? "allowed" : "blocked";
         countRateLimitDecision({ endpoint: endpointKey, role, decision });
 
-        if (!result.allowed && !rateLimitConfig.shadowMode) {
+        if (result.allowed && !rateLimitConfig.shadowMode) {
           const res = NextResponse.json(
             { success: false, error: "Too many requests. Please try again later." },
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: expected 429 to be 201 // Object.is equality

[Killed] BooleanLiteral
lib/rate-limiting/middleware.ts:147:24
 
         if (!result.allowed && !rateLimitConfig.shadowMode) {
           const res = NextResponse.json(
-            { success: false, error: "Too many requests. Please try again later." },
+            { success: true, error: "Too many requests. Please try again later." },
             {
               status: 429,
killedBy: PF5 — Concurrent AI enhancement rate limit concurrent requests do not double-count beyond 5/day
statusReason: Invalid `prisma.resume.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\resume.factory.ts:19:24

  16   userId: string,
  17   overrides?: Partial<Prisma.ResumeUncheckedCreateInput>,
  18 ) {
→ 19   return prisma.resume.create(
Foreign key constraint violated on the constraint: `resume_userId_fkey`

[Survived] StringLiteral
lib/rate-limiting/middleware.ts:147:38
 
         if (!result.allowed && !rateLimitConfig.shadowMode) {
           const res = NextResponse.json(
-            { success: false, error: "Too many requests. Please try again later." },
+            { success: false, error: "" },
             {
               status: 429,

[Killed] BlockStatement
lib/rate-limiting/middleware.ts:163:48
 
         const response = await runHandler();
 
-        if (response && "headers" in response) {
-          response.headers.set("X-RateLimit-Limit", String(result.limit));
-          response.headers.set("X-RateLimit-Remaining", String(result.remaining));
-          response.headers.set("X-RateLimit-Reset", String(result.reset));
-        }
+        if (response && "headers" in response) {}
 
         return response;
killedBy: User Resumes CRUD (Phase 4.7) list own resumes
statusReason: Invalid `prisma.resume.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\resume.factory.ts:19:24

  16   userId: string,
  17   overrides?: Partial<Prisma.ResumeUncheckedCreateInput>,
  18 ) {
→ 19   return prisma.resume.create(
Foreign key constraint violated on the constraint: `resume_userId_fkey`

[Killed] LogicalOperator
lib/rate-limiting/middleware.ts:163:13
 
         const response = await runHandler();
 
-        if (response && "headers" in response) {
+        if (response || "headers" in response) {
           response.headers.set("X-RateLimit-Limit", String(result.limit));
           response.headers.set("X-RateLimit-Remaining", String(result.remaining));
killedBy: Apply to Job (Phase 4.3) duplicate apply blocked
statusReason: expected 404 to be 409 // Object.is equality

[Killed] BlockStatement
lib/rate-limiting/middleware.ts:172:17
         return response;
       };
 
-      if (user) {
-        return runWithSessionCache({ session: { ...baseSession } }, async () => {
-          return runRateLimit();
-        });
-      }
+      if (user) {}
 
       return runWithSessionCache({ session: null }, async () => {
killedBy: IDOR — Message Thread Isolation recruiter A cannot access thread between user and recruiter B
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[Killed] ConditionalExpression
lib/rate-limiting/middleware.ts:172:11
         return response;
       };
 
-      if (user) {
+      if (false) {
         return runWithSessionCache({ session: { ...baseSession } }, async () => {
           return runRateLimit();
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: Invalid `prisma.job.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\job.factory.ts:25:21

  22 ) {
  23   const title = overrides?.title ?? faker.person.jobTitle();
  24   const slug = overrides?.slug ?? slugify(title);
→ 25   return prisma.job.create(
Foreign key constraint violated on the constraint: `job_recruiterId_fkey`

[Killed] BlockStatement
lib/rate-limiting/middleware.ts:173:81
       };
 
       if (user) {
-        return runWithSessionCache({ session: { ...baseSession } }, async () => {
-          return runRateLimit();
-        });
+        return runWithSessionCache({ session: { ...baseSession } }, async () => {});
       }
 
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] ObjectLiteral
lib/rate-limiting/middleware.ts:173:36
       };
 
       if (user) {
-        return runWithSessionCache({ session: { ...baseSession } }, async () => {
+        return runWithSessionCache({}, async () => {
           return runRateLimit();
         });
killedBy: User Resumes CRUD (Phase 4.7) list own resumes
statusReason: Invalid `prisma.resume.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\resume.factory.ts:19:24

  16   userId: string,
  17   overrides?: Partial<Prisma.ResumeUncheckedCreateInput>,
  18 ) {
→ 19   return prisma.resume.create(
Foreign key constraint violated on the constraint: `resume_userId_fkey`

[Killed] BlockStatement
lib/rate-limiting/middleware.ts:178:65
         });
       }
 
-      return runWithSessionCache({ session: null }, async () => {
-        return runRateLimit();
-      });
+      return runWithSessionCache({ session: null }, async () => {});
     };
   }
killedBy: createWithRateLimit applies anonymous multiplier for unauthenticated requests
statusReason: expected "spy" to be called at least once
