[Killed] BlockStatement
lib/rate-limiting/repository.fake.ts:6:89
 export class FakeRepository implements RateLimitRepository {
   private store = new Map<string, { count: number; lastRequest: bigint }>();
 
-  async increment(key: string, now: bigint, cutoff: bigint): Promise<{ count: number }> {
-    const existing = this.store.get(key);
-    if (!existing || existing.lastRequest < cutoff) {
-      this.store.set(key, { count: 1, lastRequest: now });
-      return { count: 1 };
-    }
-    existing.count++;
-    existing.lastRequest = now;
-    return { count: existing.count };
-  }
+  async increment(key: string, now: bigint, cutoff: bigint): Promise<{ count: number }> {}
 
   async deleteById(key: string): Promise<void> {
killedBy: benchmark - extended metrics RateLimiterImpl.check single key benchmark
statusReason: Cannot destructure property 'count' of '(intermediate value)' as it is undefined.

[Killed] LogicalOperator
lib/rate-limiting/repository.fake.ts:8:9
 
   async increment(key: string, now: bigint, cutoff: bigint): Promise<{ count: number }> {
     const existing = this.store.get(key);
-    if (!existing || existing.lastRequest < cutoff) {
+    if (!existing && existing.lastRequest < cutoff) {
       this.store.set(key, { count: 1, lastRequest: now });
       return { count: 1 };
killedBy: benchmark - extended metrics RateLimiterImpl.check single key benchmark
statusReason: Cannot read properties of undefined (reading 'lastRequest')

[Killed] ConditionalExpression
lib/rate-limiting/repository.fake.ts:8:9
 
   async increment(key: string, now: bigint, cutoff: bigint): Promise<{ count: number }> {
     const existing = this.store.get(key);
-    if (!existing || existing.lastRequest < cutoff) {
+    if (false) {
       this.store.set(key, { count: 1, lastRequest: now });
       return { count: 1 };
killedBy: benchmark - extended metrics RateLimiterImpl.check single key benchmark
statusReason: Cannot read properties of undefined (reading 'count')

[Killed] ObjectLiteral
lib/rate-limiting/repository.fake.ts:10:14
     const existing = this.store.get(key);
     if (!existing || existing.lastRequest < cutoff) {
       this.store.set(key, { count: 1, lastRequest: now });
-      return { count: 1 };
+      return {};
     }
     existing.count++;
killedBy: cleanup pruneAppKeys only deletes app: and anon: prefixed keys, preserves other: keys
statusReason: actual value must be number or bigint, received "undefined"

[Killed] UpdateOperator
lib/rate-limiting/repository.fake.ts:12:5
       this.store.set(key, { count: 1, lastRequest: now });
       return { count: 1 };
     }
-    existing.count++;
+    existing.count--;
     existing.lastRequest = now;
     return { count: existing.count };
killedBy: Rate limiting fuzz FakeRepository edge cases handles empty keys
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
lib/rate-limiting/repository.fake.ts:17:48
     return { count: existing.count };
   }
 
-  async deleteById(key: string): Promise<void> {
-    this.store.delete(key);
-  }
+  async deleteById(key: string): Promise<void> {}
 
   async deleteAllAppKeys(): Promise<void> {
killedBy: RateLimiterImpl reset clears a specific key
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
lib/rate-limiting/repository.fake.ts:21:43
     this.store.delete(key);
   }
 
-  async deleteAllAppKeys(): Promise<void> {
-    for (const key of this.store.keys()) {
-      if (key.startsWith("app:")) this.store.delete(key);
-    }
-  }
+  async deleteAllAppKeys(): Promise<void> {}
 
   // eslint-disable-next-line @typescript-eslint/no-unused-vars
killedBy: RateLimiterImpl reset with no key clears all app keys
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
lib/rate-limiting/repository.fake.ts:22:42
   }
 
   async deleteAllAppKeys(): Promise<void> {
-    for (const key of this.store.keys()) {
-      if (key.startsWith("app:")) this.store.delete(key);
-    }
+    for (const key of this.store.keys()) {}
   }
 
killedBy: RateLimiterImpl reset with no key clears all app keys
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
lib/rate-limiting/repository.fake.ts:23:11
 
   async deleteAllAppKeys(): Promise<void> {
     for (const key of this.store.keys()) {
-      if (key.startsWith("app:")) this.store.delete(key);
+      if (false) this.store.delete(key);
     }
   }
killedBy: RateLimiterImpl reset with no key clears all app keys
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
lib/rate-limiting/repository.fake.ts:23:11
 
   async deleteAllAppKeys(): Promise<void> {
     for (const key of this.store.keys()) {
-      if (key.startsWith("app:")) this.store.delete(key);
+      if (true) this.store.delete(key);
     }
   }
killedBy: FakeRepository contract FakeRepository — repository contract deleteAllAppKeys removes app: rows but preserves others
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
lib/rate-limiting/repository.fake.ts:31:27
   async pruneAppKeys(
     cutoff: bigint,
     _options?: { batchSize?: number; budgetMs?: number },
-  ): Promise<PruneResult> {
-    const start = Date.now();
-    let deleted = 0;
-    for (const [key, row] of this.store.entries()) {
-      if ((key.startsWith("app:") || key.startsWith("anon:")) && row.lastRequest < cutoff) {
-        this.store.delete(key);
-        deleted++;
-      }
-    }
-    return {
-      rowsDeleted: deleted,
-      batchesExecuted: 1,
-      durationMs: Date.now() - start,
-      timedOut: false,
-    };
-  }
+  ): Promise<PruneResult> {}
 
   _clear(): void {
killedBy: Rate limiting fuzz FakeRepository edge cases handles pruneAppKeys with empty store
statusReason: Cannot read properties of undefined (reading 'rowsDeleted')

[Killed] BlockStatement
lib/rate-limiting/repository.fake.ts:34:52
   ): Promise<PruneResult> {
     const start = Date.now();
     let deleted = 0;
-    for (const [key, row] of this.store.entries()) {
-      if ((key.startsWith("app:") || key.startsWith("anon:")) && row.lastRequest < cutoff) {
-        this.store.delete(key);
-        deleted++;
-      }
-    }
+    for (const [key, row] of this.store.entries()) {}
     return {
       rowsDeleted: deleted,
killedBy: cleanup pruneAppKeys removes expired app: keys
statusReason: expected +0 to be 3 // Object.is equality

[Killed] LogicalOperator
lib/rate-limiting/repository.fake.ts:35:12
     const start = Date.now();
     let deleted = 0;
     for (const [key, row] of this.store.entries()) {
-      if ((key.startsWith("app:") || key.startsWith("anon:")) && row.lastRequest < cutoff) {
+      if ((key.startsWith("app:") && key.startsWith("anon:")) && row.lastRequest < cutoff) {
         this.store.delete(key);
         deleted++;
killedBy: FakeRepository — repository contract pruneAppKeys removes expired app: keys
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
lib/rate-limiting/repository.fake.ts:35:66
     const start = Date.now();
     let deleted = 0;
     for (const [key, row] of this.store.entries()) {
-      if ((key.startsWith("app:") || key.startsWith("anon:")) && row.lastRequest < cutoff) {
+      if ((key.startsWith("app:") || key.startsWith("anon:")) && row.lastRequest >= cutoff) {
         this.store.delete(key);
         deleted++;
killedBy: FakeRepository contract FakeRepository — repository contract pruneAppKeys removes expired app: keys
statusReason: expected +0 to be 1 // Object.is equality

[Killed] UpdateOperator
lib/rate-limiting/repository.fake.ts:37:9
     for (const [key, row] of this.store.entries()) {
       if ((key.startsWith("app:") || key.startsWith("anon:")) && row.lastRequest < cutoff) {
         this.store.delete(key);
-        deleted++;
+        deleted--;
       }
     }
killedBy: FakeRepository contract FakeRepository — repository contract pruneAppKeys removes expired app: keys
statusReason: expected -1 to be 1 // Object.is equality

[Survived] ArithmeticOperator
lib/rate-limiting/repository.fake.ts:43:19
     return {
       rowsDeleted: deleted,
       batchesExecuted: 1,
-      durationMs: Date.now() - start,
+      durationMs: Date.now() + start,
       timedOut: false,
     };

[Killed] BooleanLiteral
lib/rate-limiting/repository.fake.ts:44:17
       rowsDeleted: deleted,
       batchesExecuted: 1,
       durationMs: Date.now() - start,
-      timedOut: false,
+      timedOut: true,
     };
   }
killedBy: Rate limiting fuzz FakeRepository edge cases handles pruneAppKeys with empty store
statusReason: expected true to be false // Object.is equality

[NoCoverage] BlockStatement
lib/rate-limiting/repository.fake.ts:48:18
     };
   }
 
-  _clear(): void {
-    this.store.clear();
-  }
+  _clear(): void {}
 }
 
