[Killed] BlockStatement
lib/rate-limiting/clock.ts:4:17
 import type { Clock } from "./types";
 
 export class SystemClock implements Clock {
-  now(): number {
-    return Date.now();
-  }
+  now(): number {}
 }
 
killedBy: User Resumes CRUD (Phase 4.7) list own resumes
statusReason: Invalid `prisma.resume.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\resume.factory.ts:19:24

  16   userId: string,
  17   overrides?: Partial<Prisma.ResumeUncheckedCreateInput>,
  18 ) {
→ 19   return prisma.resume.create(
Foreign key constraint violated on the constraint: `resume_userId_fkey`

[Killed] BlockStatement
lib/rate-limiting/clock.ts:12:47
 export class FakeClock implements Clock {
   private _now: number;
 
-  constructor(initialMs: number = Date.now()) {
-    this._now = initialMs;
-  }
+  constructor(initialMs: number = Date.now()) {}
 
   now(): number {
killedBy: benchmark - extended metrics RateLimiterImpl.check single key benchmark
statusReason: Cannot convert undefined to a BigInt

[Killed] BlockStatement
lib/rate-limiting/clock.ts:16:17
     this._now = initialMs;
   }
 
-  now(): number {
-    return this._now;
-  }
+  now(): number {}
 
   advance(ms: number): void {
killedBy: benchmark - extended metrics RateLimiterImpl.check single key benchmark
statusReason: Cannot convert undefined to a BigInt

[Killed] BlockStatement
lib/rate-limiting/clock.ts:20:29
     return this._now;
   }
 
-  advance(ms: number): void {
-    this._now += ms;
-  }
+  advance(ms: number): void {}
 
   setTime(ms: number): void {
killedBy: cleanup pruneAppKeys removes expired app: keys
statusReason: expected +0 to be 3 // Object.is equality

[Killed] AssignmentOperator
lib/rate-limiting/clock.ts:21:5
   }
 
   advance(ms: number): void {
-    this._now += ms;
+    this._now -= ms;
   }
 
killedBy: cleanup pruneAppKeys removes expired app: keys
statusReason: expected +0 to be 3 // Object.is equality

[Killed] BlockStatement
lib/rate-limiting/clock.ts:24:29
     this._now += ms;
   }
 
-  setTime(ms: number): void {
-    this._now = ms;
-  }
+  setTime(ms: number): void {}
 }
 
killedBy: RateLimiterImpl single clock capture ensures consistent retryAfter and reset
statusReason: expected 1000000060 to be 65 // Object.is equality
