[Killed] BlockStatement
lib/rate-limiting/ip-hash.ts:4:85
 import { createHmac } from "node:crypto";
 import type { IPHasher } from "./types";
 
-export function ipHash(ip: string, salt: string, digestLength: number = 16): string {
-  const hash = createHmac("sha256", salt).update(ip).digest("hex");
-  return hash.substring(0, digestLength);
-}
+export function ipHash(ip: string, salt: string, digestLength: number = 16): string {}
 
 export class IPHasherImpl implements IPHasher {
killedBy: Rate limiting fuzz ipHash edge cases handles empty IP
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] StringLiteral
lib/rate-limiting/ip-hash.ts:5:61
 import type { IPHasher } from "./types";
 
 export function ipHash(ip: string, salt: string, digestLength: number = 16): string {
-  const hash = createHmac("sha256", salt).update(ip).digest("hex");
+  const hash = createHmac("sha256", salt).update(ip).digest("");
   return hash.substring(0, digestLength);
 }
killedBy: createWithRateLimit applies anonymous multiplier for unauthenticated requests
statusReason: hash.substring is not a function

[Killed] MethodExpression
lib/rate-limiting/ip-hash.ts:6:10
 
 export function ipHash(ip: string, salt: string, digestLength: number = 16): string {
   const hash = createHmac("sha256", salt).update(ip).digest("hex");
-  return hash.substring(0, digestLength);
+  return hash;
 }
 
killedBy: Rate limiting fuzz ipHash edge cases handles empty IP
statusReason: expected 64 to be 16 // Object.is equality

[Killed] BlockStatement
lib/rate-limiting/ip-hash.ts:13:56
   private salt: string;
   private digestLength: number;
 
-  constructor(salt: string, digestLength: number = 16) {
-    this.salt = salt;
-    this.digestLength = digestLength;
-  }
+  constructor(salt: string, digestLength: number = 16) {}
 
   hash(ip: string): string {
killedBy: ipHash IPHasherImpl uses configured salt and length
statusReason: The "key" argument must be of type string or an instance of ArrayBuffer, Buffer, TypedArray, DataView, KeyObject, or CryptoKey. Received undefined

[Killed] BlockStatement
lib/rate-limiting/ip-hash.ts:18:28
     this.digestLength = digestLength;
   }
 
-  hash(ip: string): string {
-    return ipHash(ip, this.salt, this.digestLength);
-  }
+  hash(ip: string): string {}
 }
 
killedBy: ipHash IPHasherImpl uses configured salt and length
statusReason: Cannot read properties of undefined (reading 'length')
