[Killed] BlockStatement
lib/rate-limiting/rate-limiter.ts:13:85
     private clock: Clock,
   ) {}
 
-  async check(key: string, max: number, windowMs: number): Promise<RateLimitResult> {
-    const now = this.clock.now();
-    const { count } = await this.repo.increment(key, BigInt(now), BigInt(now - windowMs));
-    const allowed = count <= max;
-    const reset = Math.ceil((now + windowMs) / 1000);
-    return {
-      allowed,
-      limit: max,
-      remaining: Math.max(0, max - count),
-      reset,
-      retryAfter: Math.max(1, reset - Math.ceil(now / 1000)),
-    };
-  }
+  async check(key: string, max: number, windowMs: number): Promise<RateLimitResult> {}
 
   async enforce(key: string, max: number, windowMs: number): Promise<void> {
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[Killed] ArithmeticOperator
lib/rate-limiting/rate-limiter.ts:15:74
 
   async check(key: string, max: number, windowMs: number): Promise<RateLimitResult> {
     const now = this.clock.now();
-    const { count } = await this.repo.increment(key, BigInt(now), BigInt(now - windowMs));
+    const { count } = await this.repo.increment(key, BigInt(now), BigInt(now + windowMs));
     const allowed = count <= max;
     const reset = Math.ceil((now + windowMs) / 1000);
killedBy: User Resumes CRUD (Phase 4.7) list own resumes
statusReason: Invalid `prisma.resume.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\resume.factory.ts:19:24

  16   userId: string,
  17   overrides?: Partial<Prisma.ResumeUncheckedCreateInput>,
  18 ) {
→ 19   return prisma.resume.create(
Foreign key constraint violated on the constraint: `resume_userId_fkey`

[Killed] EqualityOperator
lib/rate-limiting/rate-limiter.ts:16:21
   async check(key: string, max: number, windowMs: number): Promise<RateLimitResult> {
     const now = this.clock.now();
     const { count } = await this.repo.increment(key, BigInt(now), BigInt(now - windowMs));
-    const allowed = count <= max;
+    const allowed = count > max;
     const reset = Math.ceil((now + windowMs) / 1000);
     return {
killedBy: IDOR — User Resource Isolation user A cannot see user B's bookmark
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[Killed] ConditionalExpression
lib/rate-limiting/rate-limiter.ts:16:21
   async check(key: string, max: number, windowMs: number): Promise<RateLimitResult> {
     const now = this.clock.now();
     const { count } = await this.repo.increment(key, BigInt(now), BigInt(now - windowMs));
-    const allowed = count <= max;
+    const allowed = true;
     const reset = Math.ceil((now + windowMs) / 1000);
     return {
killedBy: IDOR — User Resource Isolation user A cannot see user B's notifications
statusReason: Invalid `prisma.notification.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\integration\auth\auth.idor.test.ts:173:31

  170 const userA = await createTestUser({ role: Role.user });
  171 const userB = await createTestUser({ role: Role.user });
  172 
→ 173 await prisma.notification.create(
Foreign key constraint violated on the constraint: `notification_userId_fkey

[Killed] ArithmeticOperator
lib/rate-limiting/rate-limiter.ts:17:30
     const now = this.clock.now();
     const { count } = await this.repo.increment(key, BigInt(now), BigInt(now - windowMs));
     const allowed = count <= max;
-    const reset = Math.ceil((now + windowMs) / 1000);
+    const reset = Math.ceil((now - windowMs) / 1000);
     return {
       allowed,
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[Killed] ArithmeticOperator
lib/rate-limiting/rate-limiter.ts:17:29
     const now = this.clock.now();
     const { count } = await this.repo.increment(key, BigInt(now), BigInt(now - windowMs));
     const allowed = count <= max;
-    const reset = Math.ceil((now + windowMs) / 1000);
+    const reset = Math.ceil((now + windowMs) * 1000);
     return {
       allowed,
killedBy: User Resumes CRUD (Phase 4.7) list own resumes
statusReason: Invalid `prisma.resume.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\resume.factory.ts:19:24

  16   userId: string,
  17   overrides?: Partial<Prisma.ResumeUncheckedCreateInput>,
  18 ) {
→ 19   return prisma.resume.create(
Foreign key constraint violated on the constraint: `resume_userId_fkey`

[Killed] ArithmeticOperator
lib/rate-limiting/rate-limiter.ts:21:30
     return {
       allowed,
       limit: max,
-      remaining: Math.max(0, max - count),
+      remaining: Math.max(0, max + count),
       reset,
       retryAfter: Math.max(1, reset - Math.ceil(now / 1000)),
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: expected 404 to be 201 // Object.is equality

[Killed] MethodExpression
lib/rate-limiting/rate-limiter.ts:21:18
     return {
       allowed,
       limit: max,
-      remaining: Math.max(0, max - count),
+      remaining: Math.min(0, max - count),
       reset,
       retryAfter: Math.max(1, reset - Math.ceil(now / 1000)),
killedBy: Apply to Job (Phase 4.3) duplicate apply blocked
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[Killed] MethodExpression
lib/rate-limiting/rate-limiter.ts:23:19
       limit: max,
       remaining: Math.max(0, max - count),
       reset,
-      retryAfter: Math.max(1, reset - Math.ceil(now / 1000)),
+      retryAfter: Math.min(1, reset - Math.ceil(now / 1000)),
     };
   }
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: expected 500 to be 201 // Object.is equality

[Killed] ArithmeticOperator
lib/rate-limiting/rate-limiter.ts:23:31
       limit: max,
       remaining: Math.max(0, max - count),
       reset,
-      retryAfter: Math.max(1, reset - Math.ceil(now / 1000)),
+      retryAfter: Math.max(1, reset + Math.ceil(now / 1000)),
     };
   }
killedBy: User Bookmarks (Phase 4.12) list bookmarks returns all user bookmarks
statusReason: expected [] to have a length of 3 but got +0

[Killed] BlockStatement
lib/rate-limiting/rate-limiter.ts:27:76
     };
   }
 
-  async enforce(key: string, max: number, windowMs: number): Promise<void> {
-    const result = await this.check(key, max, windowMs);
-    if (!result.allowed)
-      throw new TooManyRequestsError("Rate limit exceeded. Please try again later.");
-  }
+  async enforce(key: string, max: number, windowMs: number): Promise<void> {}
 
   async reset(key?: string): Promise<void> {
killedBy: RateLimiterImpl enforce throws TooManyRequestsError when blocked
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BooleanLiteral
lib/rate-limiting/rate-limiter.ts:29:9
 
   async enforce(key: string, max: number, windowMs: number): Promise<void> {
     const result = await this.check(key, max, windowMs);
-    if (!result.allowed)
+    if (result.allowed)
       throw new TooManyRequestsError("Rate limit exceeded. Please try again later.");
   }
killedBy: RateLimiterImpl enforce throws TooManyRequestsError when blocked
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
lib/rate-limiting/rate-limiter.ts:29:9
 
   async enforce(key: string, max: number, windowMs: number): Promise<void> {
     const result = await this.check(key, max, windowMs);
-    if (!result.allowed)
+    if (false)
       throw new TooManyRequestsError("Rate limit exceeded. Please try again later.");
   }
killedBy: RateLimiterImpl enforce throws TooManyRequestsError when blocked
statusReason: promise resolved "undefined" instead of rejecting

[Survived] StringLiteral
lib/rate-limiting/rate-limiter.ts:30:38
   async enforce(key: string, max: number, windowMs: number): Promise<void> {
     const result = await this.check(key, max, windowMs);
     if (!result.allowed)
-      throw new TooManyRequestsError("Rate limit exceeded. Please try again later.");
+      throw new TooManyRequestsError("");
   }
 

[Killed] BlockStatement
lib/rate-limiting/rate-limiter.ts:33:44
       throw new TooManyRequestsError("Rate limit exceeded. Please try again later.");
   }
 
-  async reset(key?: string): Promise<void> {
-    if (key) await this.repo.deleteById(key);
-    else await this.repo.deleteAllAppKeys();
-  }
+  async reset(key?: string): Promise<void> {}
 
   async prune(): Promise<void> {
killedBy: RateLimiterImpl reset clears a specific key
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
lib/rate-limiting/rate-limiter.ts:34:9
   }
 
   async reset(key?: string): Promise<void> {
-    if (key) await this.repo.deleteById(key);
+    if (true) await this.repo.deleteById(key);
     else await this.repo.deleteAllAppKeys();
   }
killedBy: RateLimiterImpl reset with no key clears all app keys
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
lib/rate-limiting/rate-limiter.ts:34:9
   }
 
   async reset(key?: string): Promise<void> {
-    if (key) await this.repo.deleteById(key);
+    if (false) await this.repo.deleteById(key);
     else await this.repo.deleteAllAppKeys();
   }
killedBy: RateLimiterImpl reset clears a specific key
statusReason: expected false to be true // Object.is equality

[Survived] BlockStatement
lib/rate-limiting/rate-limiter.ts:38:32
     else await this.repo.deleteAllAppKeys();
   }
 
-  async prune(): Promise<void> {
-    const now = this.clock.now();
-    const cutoff = BigInt(now - rateLimitConfig.cleanup.retentionMs);
-    const result = await this.repo.pruneAppKeys(cutoff);
-    recordCleanupMetrics(result);
-  }
+  async prune(): Promise<void> {}
 }
 

[Survived] ArithmeticOperator
lib/rate-limiting/rate-limiter.ts:40:27
 
   async prune(): Promise<void> {
     const now = this.clock.now();
-    const cutoff = BigInt(now - rateLimitConfig.cleanup.retentionMs);
+    const cutoff = BigInt(now + rateLimitConfig.cleanup.retentionMs);
     const result = await this.repo.pruneAppKeys(cutoff);
     recordCleanupMetrics(result);
