[Killed] BlockStatement
lib/rate-limiting/repository.ts:23:89
 }
 
 export class PrismaRateLimitRepository implements RateLimitRepository {
-  async increment(key: string, now: bigint, cutoff: bigint): Promise<{ count: number }> {
-    const [row] = await prisma.$queryRaw<Array<{ count: bigint }>>(Prisma.sql`
-      INSERT INTO rate_limit (id, key, count, "lastRequest")
-      VALUES (${key}, ${key}, 1, ${now})
-      ON CONFLICT (id) DO UPDATE SET
-        count = CASE
-          WHEN rate_limit."lastRequest" < ${cutoff} THEN 1
-          ELSE rate_limit.count + 1
-        END,
-        "lastRequest" = ${now}
-      RETURNING count
-    `);
-    return { count: row ? Number(row.count) : 1 };
-  }
+  async increment(key: string, now: bigint, cutoff: bigint): Promise<{ count: number }> {}
 
   async deleteById(key: string): Promise<void> {
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: expected 404 to be 201 // Object.is equality

[Killed] BlockStatement
lib/rate-limiting/repository.ts:38:48
     return { count: row ? Number(row.count) : 1 };
   }
 
-  async deleteById(key: string): Promise<void> {
-    await prisma.rateLimit.deleteMany({ where: { id: key } });
-  }
+  async deleteById(key: string): Promise<void> {}
 
   async deleteAllAppKeys(): Promise<void> {
killedBy: PrismaRateLimitRepository contract deleteById removes only the specified key
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BlockStatement
lib/rate-limiting/repository.ts:42:43
     await prisma.rateLimit.deleteMany({ where: { id: key } });
   }
 
-  async deleteAllAppKeys(): Promise<void> {
-    await prisma.rateLimit.deleteMany({ where: { id: { startsWith: "app:" } } });
-  }
+  async deleteAllAppKeys(): Promise<void> {}
 
   async pruneAppKeys(
killedBy: PrismaRateLimitRepository contract deleteAllAppKeys removes app: rows but preserves others
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ObjectLiteral
lib/rate-limiting/repository.ts:43:39
   }
 
   async deleteAllAppKeys(): Promise<void> {
-    await prisma.rateLimit.deleteMany({ where: { id: { startsWith: "app:" } } });
+    await prisma.rateLimit.deleteMany({});
   }
 
killedBy: PrismaRateLimitRepository contract deleteAllAppKeys removes app: rows but preserves others
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ObjectLiteral
lib/rate-limiting/repository.ts:43:48
   }
 
   async deleteAllAppKeys(): Promise<void> {
-    await prisma.rateLimit.deleteMany({ where: { id: { startsWith: "app:" } } });
+    await prisma.rateLimit.deleteMany({ where: {} });
   }
 
killedBy: PrismaRateLimitRepository contract deleteAllAppKeys removes app: rows but preserves others
statusReason: expected 1 to be 2 // Object.is equality

[Killed] OptionalChaining
lib/rate-limiting/repository.ts:51:23
     options?: { batchSize?: number; budgetMs?: number },
   ): Promise<PruneResult> {
     const start = Date.now();
-    const batchSize = options?.batchSize ?? rateLimitConfig.cleanup.batchSize;
+    const batchSize = options.batchSize ?? rateLimitConfig.cleanup.batchSize;
     const budgetMs = options?.budgetMs ?? rateLimitConfig.cleanup.budgetMs;
     let totalDeleted = 0;
killedBy: PrismaRateLimitRepository contract pruneAppKeys removes expired app: and anon: keys
statusReason: Cannot read properties of undefined (reading 'batchSize')

[Survived] LogicalOperator
lib/rate-limiting/repository.ts:51:23
     options?: { batchSize?: number; budgetMs?: number },
   ): Promise<PruneResult> {
     const start = Date.now();
-    const batchSize = options?.batchSize ?? rateLimitConfig.cleanup.batchSize;
+    const batchSize = options?.batchSize && rateLimitConfig.cleanup.batchSize;
     const budgetMs = options?.budgetMs ?? rateLimitConfig.cleanup.budgetMs;
     let totalDeleted = 0;

[Killed] OptionalChaining
lib/rate-limiting/repository.ts:52:22
   ): Promise<PruneResult> {
     const start = Date.now();
     const batchSize = options?.batchSize ?? rateLimitConfig.cleanup.batchSize;
-    const budgetMs = options?.budgetMs ?? rateLimitConfig.cleanup.budgetMs;
+    const budgetMs = options.budgetMs ?? rateLimitConfig.cleanup.budgetMs;
     let totalDeleted = 0;
     let batches = 0;
killedBy: PrismaRateLimitRepository contract pruneAppKeys removes expired app: and anon: keys
statusReason: Cannot read properties of undefined (reading 'budgetMs')

[Survived] LogicalOperator
lib/rate-limiting/repository.ts:52:22
   ): Promise<PruneResult> {
     const start = Date.now();
     const batchSize = options?.batchSize ?? rateLimitConfig.cleanup.batchSize;
-    const budgetMs = options?.budgetMs ?? rateLimitConfig.cleanup.budgetMs;
+    const budgetMs = options?.budgetMs && rateLimitConfig.cleanup.budgetMs;
     let totalDeleted = 0;
     let batches = 0;

[Killed] ConditionalExpression
lib/rate-limiting/repository.ts:56:12
     let totalDeleted = 0;
     let batches = 0;
 
-    while (true) {
+    while (false) {
       const elapsed = Date.now() - start;
       if (elapsed >= budgetMs) {
killedBy: PrismaRateLimitRepository contract pruneAppKeys removes expired app: and anon: keys
statusReason: expected 0 to be greater than or equal to 2

[Killed] ArithmeticOperator
lib/rate-limiting/repository.ts:57:23
     let batches = 0;
 
     while (true) {
-      const elapsed = Date.now() - start;
+      const elapsed = Date.now() + start;
       if (elapsed >= budgetMs) {
         return {
killedBy: PrismaRateLimitRepository contract pruneAppKeys removes expired app: and anon: keys
statusReason: expected 0 to be greater than or equal to 2

[Killed] BlockStatement
lib/rate-limiting/repository.ts:58:32
 
     while (true) {
       const elapsed = Date.now() - start;
-      if (elapsed >= budgetMs) {
-        return {
-          rowsDeleted: totalDeleted,
-          batchesExecuted: batches,
-          durationMs: elapsed,
-          timedOut: true,
-        };
-      }
+      if (elapsed >= budgetMs) {}
 
       const result = await prisma.$executeRaw<number>(Prisma.sql`
killedBy: PrismaRateLimitRepository contract pruneAppKeys timeout returns correct signal
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
lib/rate-limiting/repository.ts:58:11
 
     while (true) {
       const elapsed = Date.now() - start;
-      if (elapsed >= budgetMs) {
+      if (true) {
         return {
           rowsDeleted: totalDeleted,
killedBy: PrismaRateLimitRepository contract pruneAppKeys removes expired app: and anon: keys
statusReason: expected 0 to be greater than or equal to 2

[Killed] BooleanLiteral
lib/rate-limiting/repository.ts:63:21
           rowsDeleted: totalDeleted,
           batchesExecuted: batches,
           durationMs: elapsed,
-          timedOut: true,
+          timedOut: false,
         };
       }
killedBy: PrismaRateLimitRepository contract pruneAppKeys timeout returns correct signal
statusReason: expected false to be true // Object.is equality

[Killed] UpdateOperator
lib/rate-limiting/repository.ts:77:7
         )
       `);
 
-      batches++;
+      batches--;
       if (result === 0) break;
       totalDeleted += Number(result);
killedBy: PrismaRateLimitRepository contract pruneAppKeys removes expired app: and anon: keys
statusReason: expected 1 to be greater than or equal to 2

[Killed] ConditionalExpression
lib/rate-limiting/repository.ts:78:11
       `);
 
       batches++;
-      if (result === 0) break;
+      if (true) break;
       totalDeleted += Number(result);
     }
killedBy: PrismaRateLimitRepository contract pruneAppKeys removes expired app: and anon: keys
statusReason: expected 0 to be greater than or equal to 2

[Killed] EqualityOperator
lib/rate-limiting/repository.ts:78:11
       `);
 
       batches++;
-      if (result === 0) break;
+      if (result !== 0) break;
       totalDeleted += Number(result);
     }
killedBy: PrismaRateLimitRepository contract pruneAppKeys removes expired app: and anon: keys
statusReason: expected 0 to be greater than or equal to 2

[Killed] AssignmentOperator
lib/rate-limiting/repository.ts:79:7
 
       batches++;
       if (result === 0) break;
-      totalDeleted += Number(result);
+      totalDeleted -= Number(result);
     }
 
killedBy: PrismaRateLimitRepository contract pruneAppKeys removes expired app: and anon: keys
statusReason: expected 0 to be greater than or equal to 2

[Survived] ArithmeticOperator
lib/rate-limiting/repository.ts:85:19
     return {
       rowsDeleted: totalDeleted,
       batchesExecuted: batches,
-      durationMs: Date.now() - start,
+      durationMs: Date.now() + start,
       timedOut: false,
     };
