[Killed] BlockStatement
lib/rate-limiting/request-context.ts:16:56
 
 const sessionStorage = new AsyncLocalStorage<SessionCache>();
 
-export function getSessionCache(): SessionCache | null {
-  return sessionStorage.getStore() ?? null;
-}
+export function getSessionCache(): SessionCache | null {}
 
 export function runWithSessionCache<T>(cache: SessionCache, fn: () => Promise<T>): Promise<T> {
killedBy: User Bookmarks (Phase 4.12) concurrent toggle — @@unique prevents duplicates
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[Killed] LogicalOperator
lib/rate-limiting/request-context.ts:17:10
 const sessionStorage = new AsyncLocalStorage<SessionCache>();
 
 export function getSessionCache(): SessionCache | null {
-  return sessionStorage.getStore() ?? null;
+  return sessionStorage.getStore() && null;
 }
 
killedBy: Application Status Transition (Phase 4.4) applied to reviewing succeeds
statusReason: expected 409 to be 200 // Object.is equality

[Killed] BlockStatement
lib/rate-limiting/request-context.ts:20:95
   return sessionStorage.getStore() ?? null;
 }
 
-export function runWithSessionCache<T>(cache: SessionCache, fn: () => Promise<T>): Promise<T> {
-  return sessionStorage.run(cache, fn);
-}
+export function runWithSessionCache<T>(cache: SessionCache, fn: () => Promise<T>): Promise<T> {}
 
 export function setCachedSession(session: SessionCache["session"]): void {
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
lib/rate-limiting/request-context.ts:24:74
   return sessionStorage.run(cache, fn);
 }
 
-export function setCachedSession(session: SessionCache["session"]): void {
-  const store = sessionStorage.getStore();
-  if (store) {
-    store.session = session;
-  }
-}
+export function setCachedSession(session: SessionCache["session"]): void {}
 
killedBy: request-context setCachedSession updates session in current context
statusReason: expected { id: 'user-1', name: 'User 1', …(2) } to deeply equal { id: 'user-2', name: 'User 2', …(2) }

[Killed] ConditionalExpression
lib/rate-limiting/request-context.ts:26:7
 
 export function setCachedSession(session: SessionCache["session"]): void {
   const store = sessionStorage.getStore();
-  if (store) {
+  if (true) {
     store.session = session;
   }
killedBy: request-context setCachedSession does nothing when no context exists
statusReason: Cannot set properties of undefined (setting 'session')

[Killed] ConditionalExpression
lib/rate-limiting/request-context.ts:26:7
 
 export function setCachedSession(session: SessionCache["session"]): void {
   const store = sessionStorage.getStore();
-  if (store) {
+  if (false) {
     store.session = session;
   }
killedBy: request-context setCachedSession updates session in current context
statusReason: expected { id: 'user-1', name: 'User 1', …(2) } to deeply equal { id: 'user-2', name: 'User 2', …(2) }
