[Killed] BlockStatement
lib/rate-limiting/telemetry.ts:11:56
 
 const traceStorage = new AsyncLocalStorage<TraceContext>();
 
-export function getTraceContext(): TraceContext | null {
-  return traceStorage.getStore() ?? null;
-}
+export function getTraceContext(): TraceContext | null {}
 
 export function runWithTraceContext<T>(ctx: TraceContext, fn: () => Promise<T>): Promise<T> {
killedBy: telemetry runWithTraceContext runs function with provided context
statusReason: expected undefined to deeply equal { requestId: 'test-123', …(2) }

[Killed] LogicalOperator
lib/rate-limiting/telemetry.ts:12:10
 const traceStorage = new AsyncLocalStorage<TraceContext>();
 
 export function getTraceContext(): TraceContext | null {
-  return traceStorage.getStore() ?? null;
+  return traceStorage.getStore() && null;
 }
 
killedBy: telemetry runWithTraceContext runs function with provided context
statusReason: expected null to deeply equal { requestId: 'test-123', …(2) }

[Killed] BlockStatement
lib/rate-limiting/telemetry.ts:15:93
   return traceStorage.getStore() ?? null;
 }
 
-export function runWithTraceContext<T>(ctx: TraceContext, fn: () => Promise<T>): Promise<T> {
-  return traceStorage.run(ctx, fn);
-}
+export function runWithTraceContext<T>(ctx: TraceContext, fn: () => Promise<T>): Promise<T> {}
 
 export function generateRequestId(): string {
killedBy: Apply to Job (Phase 4.3) successful apply creates application and audit trail
statusReason: Invalid `prisma.company.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:16:40

  13   recruiterId: string,
  14   overrides?: Partial<Prisma.CompanyUncheckedCreateInput>,
  15 ) {
→ 16   const company = await prisma.company.create(
Foreign key constraint violated on the constraint: `company_recruiterId_fkey`

[Killed] BlockStatement
lib/rate-limiting/telemetry.ts:19:45
   return traceStorage.run(ctx, fn);
 }
 
-export function generateRequestId(): string {
-  return crypto.randomUUID().substring(0, 12);
-}
+export function generateRequestId(): string {}
 
 export function enrichLog(base: Record<string, unknown>): Record<string, unknown> {
killedBy: IDOR — Message Thread Isolation user A cannot access thread between user B and recruiter
statusReason: Invalid `prisma.companyTeamMember.create()` invocation in
D:\hire-flow-next\.stryker-tmp\sandbox-4K73k0\lib\test\factories\company.factory.ts:30:34

  27   },
  28 });
  29 
→ 30 await prisma.companyTeamMember.create(
Foreign key constraint violated on the constraint: `company_team_member_companyId_fkey`

[Killed] MethodExpression
lib/rate-limiting/telemetry.ts:20:10
 }
 
 export function generateRequestId(): string {
-  return crypto.randomUUID().substring(0, 12);
+  return crypto.randomUUID();
 }
 
killedBy: telemetry generateRequestId returns 12-character string
statusReason: expected 36 to be 12 // Object.is equality

[Killed] BlockStatement
lib/rate-limiting/telemetry.ts:23:83
   return crypto.randomUUID().substring(0, 12);
 }
 
-export function enrichLog(base: Record<string, unknown>): Record<string, unknown> {
-  const ctx = getTraceContext();
-  if (ctx) {
-    base.requestId = ctx.requestId;
-  }
-  return base;
-}
+export function enrichLog(base: Record<string, unknown>): Record<string, unknown> {}
 
killedBy: telemetry enrichLog adds requestId from trace context
statusReason: Cannot read properties of undefined (reading 'requestId')

[Killed] ConditionalExpression
lib/rate-limiting/telemetry.ts:25:7
 
 export function enrichLog(base: Record<string, unknown>): Record<string, unknown> {
   const ctx = getTraceContext();
-  if (ctx) {
+  if (true) {
     base.requestId = ctx.requestId;
   }
killedBy: telemetry enrichLog does not add requestId when no context
statusReason: Cannot read properties of null (reading 'requestId')

[Killed] BlockStatement
lib/rate-limiting/telemetry.ts:25:12
 
 export function enrichLog(base: Record<string, unknown>): Record<string, unknown> {
   const ctx = getTraceContext();
-  if (ctx) {
-    base.requestId = ctx.requestId;
-  }
+  if (ctx) {}
   return base;
 }
killedBy: telemetry enrichLog adds requestId from trace context
statusReason: expected undefined to be '5cc9b78e-55e' // Object.is equality
